In [1]:
import pandas as pd
import numpy as np

In [2]:
#任务1：将列表转化为numpy数组
data0 = [1,2,7]
arr0 = np.array(data0)

In [3]:
#任务2：新建pandas中的series数据类型，打印其大小、索引值、值
s = pd.Series(data=[100,'a',{'dic1':5}],
              index=pd.Index(['id1',20,'third'],name='my_idx'),
              dtype='object',
              name='my_name')

In [4]:
s2 = pd.Series(["1","2","7"])

In [5]:
s2.index.values

array([0, 1, 2], dtype=int64)

In [6]:
type(s2.values[0])

str

In [7]:
s2.size

3

In [8]:
s2.shape

(3,)

In [9]:
#任务3；创建dataframe类型的数据，并获取其索引、值及表大小
#"one"字符串 df=……为赋值表达式，返回函数值
d = {"one":pd.Series([1.0,2.0,3.0],index=["a","b","c"]),
    "two":pd.Series([1.0,2.0,3.0,4.0],index=["a","b","c","d"]),}
df =pd.DataFrame(d)

In [10]:
d1 ={"作者":pd.Series(['余华','残雪','莫言']),
     "作品":pd.Series(['活着','暗夜','红高粱']),
     "价格":pd.Series([35,27,38]),
     }
df2=pd.DataFrame(d1)

In [11]:
df2['作品']

0     活着
1     暗夜
2    红高粱
Name: 作品, dtype: object

In [12]:
贵州茅台原始数据=pd.read_csv(R'600519.csv')

In [13]:
#按列查询数据
贵州茅台原始数据['TURNOVER']

0        1410347008
1         463463008
2         194689000
3         177558000
4          86231000
           ...
4089     2694714080
4090    10663392512
4091     5239853056
4092     5581027328
4093     5227695104
Name: TURNOVER, Length: 4094, dtype: int64

In [14]:
贵州茅台原始数据[['TURNOVER','volume']]

         TURNOVER  volume
0      1410347008  406318
1       463463008  129647
2       194689000   53252
3       177558000   48013
4        86231000   23231
...           ...     ...
4089   2694714080   49076
4090  10663392512  204397
4091   5239853056   96885
4092   5581027328   98107
4093   5227695104   89157

[4094 rows x 2 columns]

In [15]:
#按行索引
贵州茅台=贵州茅台原始数据.set_index('day')

In [16]:
贵州茅台原始数据.loc[0]

day           2001-08-27
STOCK_CODE       6005191
open               34.51
close              35.55
maximum            37.78
minimum            32.85
volume            406318
TURNOVER      1410347008
Name: 0, dtype: object

In [17]:
#单个元素 loc索引器
贵州茅台.loc['2001-08-27']

STOCK_CODE    6.005191e+06
open          3.451000e+01
close         3.555000e+01
maximum       3.778000e+01
minimum       3.285000e+01
volume        4.063180e+05
TURNOVER      1.410347e+09
Name: 2001-08-27, dtype: float64

In [18]:
贵州茅台.loc['2001-08-27',['open','close']]

open     34.51
close    35.55
Name: 2001-08-27, dtype: float64

In [19]:
贵州茅台.loc['2001-08-27':'2018-09-05']

            STOCK_CODE    open   close  maximum  minimum  volume    TURNOVER
day
2001-08-27     6005191   34.51   35.55    37.78    32.85  406318  1410347008
2001-08-28     6005191   34.99   36.86    37.00    34.61  129647   463463008
2001-08-29     6005191   36.98   36.38    37.00    36.10   53252   194689000
2001-08-30     6005191   36.28   37.10    37.51    36.00   48013   177558000
2001-08-31     6005191   37.15   37.01    37.62    36.80   23231    86231000
...                ...     ...     ...      ...      ...     ...         ...
2018-08-30     6005191  688.21  680.40   692.60   679.01   33788  2312993216
2018-08-31     6005191  676.25  659.19   677.00   656.50   58981  3911486176
2018-09-03     6005191  652.00  666.21   667.67   650.80   30180  1992654928
2018-09-04     6005191  666.80  675.04   676.00   661.60   21540  1441658192
2018-09-05     6005191  675.00  657.79   676.99   657.00   28983  1927600144

[4058 rows x 7 columns]

In [20]:
条件1=贵州茅台['open']<35
条件2=贵州茅台['close']<35
布尔列表=条件1&条件2
贵州茅台.loc[布尔列表]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [21]:
#使用函数作为索引
def condition(pd):
    条件1=pd['open']<35
    条件2=pd['close']<35
    布尔列表=条件1&条件2
    return 布尔列表

In [22]:
贵州茅台.loc[condition]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [23]:
贵州茅台.query('open<35 and close<35')[['open','close']]

             open  close
day
2001-10-17  34.79  34.20
2001-10-18  34.20  34.04
2001-10-19  34.00  33.50
2001-10-22  33.30  32.79
2001-11-08  33.35  33.70
...           ...    ...
2004-09-21  32.09  32.30
2004-09-22  32.03  32.16
2004-09-23  32.11  33.42
2004-09-24  33.60  34.49
2004-09-27  34.95  34.93

[498 rows x 2 columns]

In [24]:
贵州茅台.sample(10)

            STOCK_CODE    open   close  maximum  minimum  volume    TURNOVER
day
2010-05-24     6005191  134.99  135.97   136.50   134.30   29783   404173632
2015-12-24     6005191  223.98  224.78   225.68   223.20   15578   350137312
2011-04-29     6005191  178.40  182.31   183.09   177.68   22084   401140720
2012-08-01     6005191  246.18  243.05   248.63   241.89   26715   654397920
2009-05-27     6005191  113.13  114.77   115.52   112.95   27630   316980544
2009-12-08     6005191  176.57  174.56   178.00   173.50   26144   456591104
2002-06-07     6005191   34.80   34.92    35.16    34.61    3622    12686067
2017-12-04     6005191  623.95  637.79   644.10   616.72   54268  3436687376
2017-01-23     6005191  356.88  351.22   359.80   349.46   32581  1151869296
2005-09-08     6005191   50.54   50.03    50.54    49.71    6308    31589421

In [25]:
贵州茅台.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4094 entries, 2001-08-27 to 2018-11-02
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STOCK_CODE  4094 non-null   int64
 1   open        4094 non-null   float64
 2   close       4094 non-null   float64
 3   maximum     4094 non-null   float64
 4   minimum     4094 non-null   float64
 5   volume      4094 non-null   int64
 6   TURNOVER    4094 non-null   int64
dtypes: float64(4), int64(3)
memory usage: 384.9+ KB

In [26]:
贵州茅台['open'].describe()

count    4094.000000
mean      182.161910
std       165.857882
min        20.900000
25%        47.405000
50%       159.930000
75%       208.500000
max       800.000000
Name: open, dtype: float64

In [27]:
result=贵州茅台['open'].unique()

In [28]:
result2=贵州茅台['open'].nunique()

In [29]:
result3=贵州茅台['open'].value_counts

In [30]:
df=pd.DataFrame({
    "name":["A","B","C","B","C","A","C"],
    "vaule":[1,3,7,2,4,3,1]
})
df.groupby("name")["vaule"].min()

name
A    1
B    2
C    1
Name: vaule, dtype: int64